<template>
  <div class="component">
    <p class="component__title">Почему не купить готовое решение?</p>
    <span class="component__subtitle">В ходе аналитической работы было выявлено огромное количество пожеланий к будущей системе, что предполагало интеграцию множества различных сервисов, каждый из которых предполагал оплату за использование. Разработка собственного софта закрывает все пожелания и функционал данных сервисов, а затраты на разработку значительно ниже затрат на лицензии, не считая интеграции и настройки. Помимо этого у заказчика были строгие требования к безопасности используемой системы, которую лучше развернуть на собственном ядре.</span>
  </div>
</template>

<script setup lang="ts">

</script>

<style lang="postcss" scoped>
.component
{
  @apply mt-[56px] flex flex-col;
  &__title
  {
    line-height: 48px; /* 133.333% */
    letter-spacing: 0.36px;
    @apply text-[#14161F] text-[36px];
  }
  &__subtitle
  {
    line-height: 32px; /* 160% */
    letter-spacing: 0.2px;
    @apply text-[#14161F] text-[20px] mt-[32px];
  }
}
</style>